app/views/plans/show.html.erb

SELECT  "weathers".* FROM "weathers" WHERE (icon = 'hazy')  ORDER BY "weathers"."id" ASC LIMIT 1
---
  <%= image_tag @plan.forecast["current_observation"]["icon_url"] %>
  <% @weather  = Weather.where(["icon = ?", @plan.forecast["current_observation"]["icon"]]).first %>

SELECT  1 AS one FROM "weathers" WHERE "weathers"."icon" = ? LIMIT 1  [["icon", "hazy"]]
---
  <br>
  <% if Weather.exists?(:icon => @plan.forecast["current_observation"]["icon"])%>